index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kenyon Branan</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Kenyon Branan</h1>
<p>
Hi! I work on syntax and its interfaces. I am particularly interested in the nature of syntactic locality, and how much non-syntactic information the syntax may make reference to. I'm currently working at <a href="https://leibniz-zas.de">ZAS</a>, after some time at <a href="https://mitcho.com/lab/">NUS</a> and <a href="https://linguistics.mit.edu">MIT</a>.
</p>

<p>
Send me mail: <a href="mailto:kgbranan@alum.mit.edu">kgbranan@alum.mit.edu</a>
</p>

<p>
Here's my <a href="https://www.dropbox.com/s/hi2rotvgu0bo38c/cv_5.pdf?dl=0">CV</a>.
</p>


<div id="outline-container-orgb89a852" class="outline-2">
<h2 id="orgb89a852">News</h2>
<div class="outline-text-2" id="text-orgb89a852">
<ul class="org-ul">
<li>Gave a talk with <a href="https://esnewman.github.io/elisenewman/">Elise Newman</a> on our joint work on locality at <a href="http://ling.cuhk.edu.hk/glowxiii/index.php">GLOW in Asia XII</a></li>
<li>Gave a talk about copy deletion at the <a href="https://mitcho.com/singsummer2022/">Singapore Summer Meeting</a></li>
<li>Gave a talk about binding and locality domains at <a href="https://uni-goettingen.de/en/oberseminar+english+linguistics/651849.html">Universität Göttingen</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
